OpenFOAM-v1812/tutorials/preProcessing/PDRsetFields/simplePipeCage/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

probes
{
    name    probes;
    type    probes;

    libs    (sampling);

    writeControl   timeStep;
    writeInterval  1;

    probeLocations
    (
        (1.5125 1.5125 0.5)
        (1.6000 1.5125 0.5)
        (1.7000 1.5125 0.5)
        (1.8000 1.5125 0.5)
        (1.9000 1.5125 0.5)
        (2.0000 1.5125 0.5)
        (2.1000 1.5125 0.5)
        (2.2000 1.5125 0.5)
        (2.3000 1.5125 0.5)
        (2.4000 1.5125 0.5)
        (2.5000 1.5125 0.5)
        (2.6000 1.5125 0.5)
        (2.7000 1.5125 0.5)
        (2.8000 1.5125 0.5)
        (2.9000 1.5125 0.5)
        (3.0000 1.5125 0.5)
        (3.2000 1.5125 0.5)
        (3.4000 1.5125 0.5)
        (3.6000 1.5125 0.5)
        (3.8000 1.5125 0.5)
        (4.0000 1.5125 0.5)
        (4.3000 1.5125 0.5)
        (4.6000 1.5125 0.5)
        (5.0000 1.5125 0.5)
    );

    fields
    (
        p
        b
        epsilon
        ft
        k
        rho
        St
        Su
        T
        U
        Xi
    );
}


// ************************************************************************* //
